In [39]:
import numpy as np
import pandas as pd

In [40]:
df = pd.read_csv('./HousePrice.csv')
#taking 5 samples from data set
df.sample(5)

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
4201,2014-07-09 00:00:00,237950.0,2.0,1.75,1460,7926,1.0,0,0,4,1460,0,1987,0,26231 187th Pl SE,Covington,WA 98042,USA
2251,2014-06-10 00:00:00,359950.0,3.0,1.75,1890,9100,2.0,0,0,4,1890,0,1952,0,1633 N 192nd St,Shoreline,WA 98133,USA
1143,2014-05-22 00:00:00,1600000.0,3.0,2.50,3160,12824,1.0,0,2,4,1820,1340,1966,0,9410 Lake Washington Blvd NE,Bellevue,WA 98004,USA
3970,2014-07-07 00:00:00,861990.0,5.0,2.75,3595,5639,2.0,0,0,3,3595,0,2014,0,9622 242nd Way NE,Redmond,WA 98053,USA
4348,2014-05-05 00:00:00,2199900.0,4.0,1.50,1120,5427,1.0,0,0,3,1120,0,1969,2014,19009-19021 SE 266th St,Covington,WA 98042,USA

In [41]:
#checking the numbers of rows and columns
df.shape

(4600, 18)

In [42]:
#checkin missing values
df.isnull().sum()

date             0
price            0
bedrooms         0
bathrooms        0
sqft_living      0
sqft_lot         0
floors           0
waterfront       0
view             0
condition        0
sqft_above       0
sqft_basement    0
yr_built         0
yr_renovated     0
street           0
city             0
statezip         0
country          0
dtype: int64

In [43]:
columns_to_drop= ["date", 'street','statezip','country']
df = df.drop(columns_to_drop, axis=1)
df.head()

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,city
0,313000.0,3.0,1.50,1340,7912,1.5,0,0,3,1340,0,1955,2005,Shoreline
1,2384000.0,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,0,Seattle
2,342000.0,3.0,2.00,1930,11947,1.0,0,0,4,1930,0,1966,0,Kent
3,420000.0,3.0,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,0,Bellevue
4,550000.0,4.0,2.50,1940,10500,1.0,0,0,4,1140,800,1976,1992,Redmond

In [44]:
df[df['yr_renovated'] !=0]['yr_renovated'].min()

1912

In [45]:
#how old house is, checking the age of house!
df['house_age']=[2023- yr_built for  yr_built in df['yr_built']]

In [46]:
#checking the when house was renovated
df['was_renovated'] = [1 if yr_renovated != 0 else 0 for yr_renovated in df['yr_renovated']]

In [47]:
#checking how recently house was renovated?
df['was_renovated_10_yrs'] = [1 if (2023 - yr_renovated) <= 10 else 0 for yr_renovated in df['yr_renovated']]
df['was_renovated_30_yrs'] = [1 if 10 < (2023 - yr_renovated) <= 30 else 0 for yr_renovated in df['yr_renovated']]

In [48]:
#droping the columns that are not required further more, 'yr_built' and 'yr_renovated'
df = df.drop(["yr_renovated", 'yr_built'], axis=1)
df.head()

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,city,house_age,was_renovated,was_renovated_10_yrs,was_renovated_30_yrs
0,313000.0,3.0,1.50,1340,7912,1.5,0,0,3,1340,0,Shoreline,68,1,0,1
1,2384000.0,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,Seattle,102,0,0,0
2,342000.0,3.0,2.00,1930,11947,1.0,0,0,4,1930,0,Kent,57,0,0,0
3,420000.0,3.0,2.25,2000,8030,1.0,0,0,4,1000,1000,Bellevue,60,0,0,0
4,550000.0,4.0,2.50,1940,10500,1.0,0,0,4,1140,800,Redmond,47,1,0,0

In [49]:
df['city'].value_counts()

Seattle                1573
Renton                  293
Bellevue                286
Redmond                 235
Issaquah                187
Kirkland                187
Kent                    185
Auburn                  176
Sammamish               175
Federal Way             148
Shoreline               123
Woodinville             115
Maple Valley             96
Mercer Island            86
Burien                   74
Snoqualmie               71
Kenmore                  66
Des Moines               58
North Bend               50
Covington                43
Duvall                   42
Lake Forest Park         36
Bothell                  33
Newcastle                33
SeaTac                   29
Tukwila                  29
Vashon                   29
Enumclaw                 28
Carnation                22
Normandy Park            18
Clyde Hill               11
Medina                   11
Fall City                11
Black Diamond             9
Ravensdale                7
Pacific                   6
Algona                    5
Yarrow Point              4
Skykomish                 3
Preston                   2
Milton                    2
Inglewood-Finn Hill       1
Snoqualmie Pass           1
Beaux Arts Village        1
Name: city, dtype: int64